# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.

# Пример:

# - 6 -> да
# - 7 -> да
# - 1 -> нет

day = int(input('Введите цифру, обозначающую день недели: '))
if day == 1: print('Понедельник - нет, не является выходным!')
elif day == 2: print('Вторник - нет, не является выходным!')
elif day == 3: print('Среда - нет, не является выходным!')
elif day == 4: print('Четверг - нет, не является выходным!')
elif day == 5: print('Пятница - нет, не является выходным!')
elif day == 6: print('Суббота - да, является выходным!')
elif day == 7: print('Воскресенье - да, является выходным!')
else: print('Введено некорректное значение')
print()


# Напишите программу для проверки истинности утверждения:
#  ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.


for x in 0, 1:
    for y in 0, 1:
        for z in 0, 1:
            print(f'{x = } {y = } {z = }')
            print(f'{not(x and y and z) == (not x or not y or not z)}')
print()

# Напишите программу, которая принимает на вход координаты точки (X и Y),
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости,
# в которой находится эта точка (или на какой оси она находится).

# Пример:

# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3

a = float(input('Введите координату x: '))
b = float(input('Введите координату y: '))
if a > 0 and b > 0: print('Точка находится в первой четверти')
elif a < 0 and b > 0: print('Точка находится во второй четверти')
elif a < 0 and b < 0: print('Точка находится в третьей четверти')
elif a > 0 and b < 0: print('Точка находится в четвёртой четверти')
elif a == 0 and b != 0: print('Точка лежит на оси x')
elif b == 0 and a != 0: print('Точка лежит на оси y')
else: print('Точка находится в начале координат, что противоречит условию, т. к. x и y не равны нулю по условию!')
print()

# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

c = int(input('Введите номер четверти: '))
if c == 1: print('x > 0 и y > 0')
elif c == 2: print('x < 0 и y > 0')
elif c == 3: print('x < 0 и y < 0')
elif c == 4: print('x > 0 и y < 0')
else: print('Введён некорректный номер четверти')
print()

# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

from math import sqrt

x1 = float(input('Введите координату x1: '))
y1 = float(input('Введите координату y1: '))
x2 = float(input('Введите координату x2: '))
y2 = float(input('Введите координату y2: '))
result = sqrt((x2 - x1)**2 + (y2 - y1)**2)
print(f'{result}')
print(f'Если округлить до сотых, то получим: {round(result, 2)}')